Написать программу, которая анализирует текстовый файл, созданный текстовым редактором, таким как ed(1) или vi(1). После запроса, который предлагает ввести номер строки, с использованием printf(3) программа печатает соответствующую строку текста. Ввод нулевого номера завершает работу программы. Используйте open(2), read(2), lseek(2) и close(2) для
 ввода/вывода. Постройте таблицу отступов в файле и длин строк для 
каждой строки файла. Как только эта таблица построена, позиционируйтесь 
на начало заданной строки и прочтите точную длину строки.
